In [49]:
import numpy as np
import pandas as pd

Making dataframe from dictionary

In [50]:
d = {'A':[1,2,3,np.nan], 'B':[5,6,np.nan,np.nan], 'C':[6, np.nan, np.nan, np.nan],'D':[7,8,9,2]}

In [51]:
df = pd.DataFrame(d)
df

     A    B    C  D
0  1.0  5.0  6.0  7
1  2.0  6.0  NaN  8
2  3.0  NaN  NaN  9
3  NaN  NaN  NaN  2

In [52]:
# Row 0 has no NaN value, column D has no NaN value.

# Droping the missing values

In [53]:
# Drop all missing Values
df.dropna()

     A    B    C  D
0  1.0  5.0  6.0  7

In [54]:
# drop along column
df.dropna(axis = 1)

   D
0  7
1  8
2  9
3  2

In [55]:
# We can select how many values should be atlest in the raw, by setting a threshold.
# thresh = 2 means there should be atleat 2 non-NaN values in the row. row 0,1 and 2 stisfies this condition.
df.dropna(thresh = 2)

     A    B    C  D
0  1.0  5.0  6.0  7
1  2.0  6.0  NaN  8
2  3.0  NaN  NaN  9

In [56]:
df.dropna(thresh = 3)

     A    B    C  D
0  1.0  5.0  6.0  7
1  2.0  6.0  NaN  8

# Filling The Missing Values

In [57]:
# Fill with string
df.fillna('No Data')

         A        B        C  D
0        1        5        6  7
1        2        6  No Data  8
2        3  No Data  No Data  9
3  No Data  No Data  No Data  2

In [58]:
# Fill with Zero
df.fillna(0)

     A    B    C  D
0  1.0  5.0  6.0  7
1  2.0  6.0  0.0  8
2  3.0  0.0  0.0  9
3  0.0  0.0  0.0  2

In [59]:
# Most common Method is to fill with Mean of the column
df['A'].fillna(df['A'].mean(), inplace = True)

In [60]:
df

     A    B    C  D
0  1.0  5.0  6.0  7
1  2.0  6.0  NaN  8
2  3.0  NaN  NaN  9
3  2.0  NaN  NaN  2

In [61]:
df['B'].fillna(df['B'].mean(), inplace = True)
df['C'].fillna(df['C'].mean(), inplace = True)

In [62]:
df

     A    B    C  D
0  1.0  5.0  6.0  7
1  2.0  6.0  6.0  8
2  3.0  5.5  6.0  9
3  2.0  5.5  6.0  2